* Editing in a field

| value 1 | value 2 | results |
|---------+---------+---------|
|       1 |       1 |       2 |
|       1 |       1 |       1 |
#+TBLFM: @2$3=$1+$2::@3$3=$1*$2

# C-c }   org-table-toggle-coordinate-overlays

| value 1 | value 2 | value 3 | value 4 | results |
|---------+---------+---------+---------+---------|
|         |         |         |         |         |
|         |         |         |         |         |
|         |         |         |         |         |
|---------+---------+---------+---------+---------|
|         |         |         |         |         |
|         |         |         |         |         |
|---------+---------+---------+---------+---------|
|         |         |         |         |         |
|         |         |         |         |         |

* Column formulas

| value 1 | value 2 | value 3 | results |
|---------+---------+---------+---------|
|       1 |       1 |       1 |       3 |
|       2 |       2 |       2 |       6 |
|       3 |       3 |       3 |       9 |
#+TBLFM: $4=vsum($1..$3)

* Automatic adaptation of field references

| value 1 | results | value 2 |
|---------+---------+---------|
|       3 |       9 |       3 |
|       1 |       2 |       1 |
#+TBLFM: @3$2=$1+$3::@2$2=$1*$3



| value 1 | value 2 | results |
|---------+---------+---------|
|       1 |       1 |       2 |
|       3 |       3 |       9 |
#+TBLFM: @2$3=$1+$2::@3$3=$1*$2



| value 1 | value 2 | results |
|---------+---------+---------|
|       1 |       1 |       2 |
|       3 |       3 |       9 |
#+TBLFM: @2$3=$1+$2::@3$3=$1*$2
* Editing in the minibuffer
#                       C-u C-c =         C-c =
| value 1 | value 2 | field formula | column formula |
|---------+---------+---------------+----------------|
|       1 |       1 | XXX           |              2 |
|       2 |       2 | 4             |              4 |
|       3 |       3 |               |              6 |
#+TBLFM: $4=vsum($1..$2)::@2$3=XXX::@3$3=vsum($1..$2)

* Editing in a dedicated buffer
| value 1 | value 2 | field formula | column formula |
|---------+---------+---------------+----------------|
|       1 |       1 |           YYY |              2 |
|       2 |       2 |             4 |              4 |
|       3 |       3 |            12 |              6 |
#+TBLFM: $4=vsum($1..$2)::@2$3=YYY::@3$3=vsum($1..$2)::@4$3=vsum(@2$1..@4$2)
